app/views/items/_form.html.erb

    <div class="col-sm-5">
	    <%= f.select :property, options_for_select(@properties.collect { |property| [property.name.titleize, property.name.titleize] }, 1), {}, { id: 'properties_select' } %>
---
SELECT "properties".* FROM "properties"  ORDER BY "properties"."name" ASC