app/views/items/index.html.erb

<% @items = Item.paginate(:page => params[:page]) %>
---
SELECT "items".* FROM "items" WHERE (serial_number LIKE '%12345%' OR device_name LIKE '%12345%')  ORDER BY created_at DESC
SELECT COUNT(*) FROM "items"