app/controllers/items_controller.rb

SELECT "items".* FROM "items" WHERE (serial_number LIKE '%12345%' OR device_name LIKE '%12345%')  ORDER BY created_at DESC
SELECT  "properties".* FROM "properties"  ORDER BY "properties"."id" ASC LIMIT 1
SELECT "departments".* FROM "departments" WHERE (property_id = 1)
---
  def index
	@items = Item.all.order("device_name DESC")
	@properties = Property.all
	@departments = Department.where("property_id = ?", Property.first.id)

SELECT "items".* FROM "items" WHERE (serial_number LIKE '%uno%' OR device_name LIKE '%uno%')  ORDER BY created_at DESC
---
  def results
	  @search = Item.search(params[:search]).order("device_name DESC")

SELECT "properties".* FROM "properties"
SELECT "departments".* FROM "departments"
---
  def new
    @item = Item.new
    @properties = Property.all
    @departments= Department.all

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 1]]
SELECT "properties".* FROM "properties"
---
  def edit
    @item = Item.find(params[:id])
    @properties = Property.all

SELECT "properties".* FROM "properties"
SELECT  1 AS one FROM "items" WHERE "items"."serial_number" = ? LIMIT 1  [["serial_number", "1W321J"]]
SELECT  1 AS one FROM "items" WHERE "items"."device_name" = ? LIMIT 1  [["device_name", "Test"]]
INSERT INTO "items" ("device_name", "description", "product_model_number", "serial_number", "vendor_name", "vendor_part_number", "quantity", "vendor_url", "location", "category", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
	  @item = Item.new(params[:item])
	  @properties = Property.all
	  @departments= Department.all
	  if Item.exists?(:serial_number=> @item.serial_number) #match on Serial Number
		  respond_to do |format|
			  #Right now these just create notices at the top of the inventory page, would like to make it so it reloads form with other data filled in and failed box highlited. Added to TODO
			  #format.html { redirect_to @item, alert: 'Items could not be created as Serial Number already exists'}
			  flash.now[:alert] = 'Items could not be created as Serial Number already exists!'
			  format.html { render :action => 'new'}

		  end
	  elsif Item.exists?(:device_name=> @item.device_name) #match on Device Name
		  respond_to do |format|
                          #format.html { redirect_to @item, notice: 'Item could not be created as Device Name already exists'}
			   flash.now[:alert] = 'Item could not be created as Device Name already exists!'
                          format.html { render :action => 'new'}
                  end
	  else #If a match on SN or name is not found
	  	  respond_to do |format|
			  if @item.save

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "items" SET "serial_number" = ?, "property" = ?, "department" = ?, "category" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["serial_number", "J"], ["property", "Radisson"], ["department", "IN STOCK"], ["category", "Tools"], ["updated_at", "2017-05-09 17:09:25.293687"], ["id", 2]]
---
  def update
    @item = Item.find(params[:id])

    respond_to do |format|
      if @item.update_attributes(params[:item])

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 3]]
DELETE FROM "items" WHERE "items"."id" = ?  [["id", 3]]
---
  def destroy
    @item = Item.find(params[:id])
    @item.destroy